_______________________________________________________________________________
Layer (type)                       Output Shape                    Param #     
===============================================================================
conv2d_1 (Conv2D)                  (None, 128, 128, 16)            448         
_______________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)     (None, 64, 64, 16)              0           
_______________________________________________________________________________
dropout_1 (Dropout)                (None, 64, 64, 16)              0           
_______________________________________________________________________________
conv2d_2 (Conv2D)                  (None, 64, 64, 32)              4640        
_______________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)     (None, 32, 32, 32)              0           
_______________________________________________________________________________
dropout_2 (Dropout)                (None, 32, 32, 32)              0           
_______________________________________________________________________________
conv2d_3 (Conv2D)                  (None, 32, 32, 64)              18496       
_______________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)     (None, 16, 16, 64)              0           
_______________________________________________________________________________
dropout_3 (Dropout)                (None, 16, 16, 64)              0           
_______________________________________________________________________________
conv2d_4 (Conv2D)                  (None, 16, 16, 128)             73856       
_______________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)     (None, 8, 8, 128)               0           
_______________________________________________________________________________
dropout_4 (Dropout)                (None, 8, 8, 128)               0           
_______________________________________________________________________________
flatten_1 (Flatten)                (None, 8192)                    0           
_______________________________________________________________________________
dense_1 (Dense)                    (None, 1024)                    8389632     
_______________________________________________________________________________
dropout_5 (Dropout)                (None, 1024)                    0           
_______________________________________________________________________________
dense_2 (Dense)                    (None, 72)                      73800       
===============================================================================
Total params: 8,560,872
Trainable params: 8,560,872
Non-trainable params: 0
_______________________________________________________________________________
