_______________________________________________________________________________
Layer (type)                       Output Shape                    Param #     
===============================================================================
conv2d_1 (Conv2D)                  (None, 58, 58, 32)              320         
_______________________________________________________________________________
activation_1 (Activation)          (None, 58, 58, 32)              0           
_______________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)     (None, 29, 29, 32)              0           
_______________________________________________________________________________
conv2d_2 (Conv2D)                  (None, 27, 27, 32)              9248        
_______________________________________________________________________________
activation_2 (Activation)          (None, 27, 27, 32)              0           
_______________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)     (None, 13, 13, 32)              0           
_______________________________________________________________________________
conv2d_3 (Conv2D)                  (None, 11, 11, 64)              18496       
_______________________________________________________________________________
activation_3 (Activation)          (None, 11, 11, 64)              0           
_______________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)     (None, 5, 5, 64)                0           
_______________________________________________________________________________
flatten_1 (Flatten)                (None, 1600)                    0           
_______________________________________________________________________________
dense_1 (Dense)                    (None, 64)                      102464      
_______________________________________________________________________________
activation_4 (Activation)          (None, 64)                      0           
_______________________________________________________________________________
dropout_1 (Dropout)                (None, 64)                      0           
_______________________________________________________________________________
dense_2 (Dense)                    (None, 2)                       130         
_______________________________________________________________________________
activation_5 (Activation)          (None, 2)                       0           
===============================================================================
Total params: 130,658
Trainable params: 130,658
Non-trainable params: 0
_______________________________________________________________________________
